# FieldId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..FieldId Property
ScheduleField Class See Also
---
The ID of the field in the containing ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFieldId FieldId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldId As ScheduleFieldId
	Get
```

Visual C++
---
```text
public:
property ScheduleFieldId^ FieldId {
	ScheduleFieldId^ get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace